[
  {
    "title": "КАРТИНКИ",
    "submenus": [
      {
        "title": "Создание изображения",
        "guide": {
          "sections": [
            {
              "type": "interactive-image",
              "src": "images/stable_diffusion_ui.png",
              "alt": "Stable Diffusion UI",
              "hotspots": [
                {
                  "top": "4%",
                  "left": "7%",
                  "tooltip": "<strong>Модель генерации:</strong> Выбрать способ создания, flux самый лучший"
                },
                {
                  "top": "17%",
                  "left": "20%",
                  "tooltip": "<strong>ОКНО ДЛЯ ВВОДА ЗАПРОСА:</strong> Сюда пишется Promt, что вы хотите увидеть на картинке. Писать нужно на английском."
                },
                {
                  "top": "25%",
                  "left": "20%",
                  "tooltip": "<strong>ОКНО ДЛЯ ВВОДА ЗАПРОСА:</strong> Сюда пишется Promt, что вы наоборот не хотите увидеть на картинке. Писать нужно на английском."
                },
                {
                  "top": "40%",
                  "left": "46%",
                  "tooltip": "<strong>Шагов для генерации:</strong> Количество шагов генерации. В идеале от 20 до 40. Чем меньше, тем быстрее."
                },
                {
                  "top": "90%",
                  "left": "20%",
                  "tooltip": "<strong>Ширина и высота картинки:</strong> Width - Ширина, Height - высота. 9:16 (1080х1920), 1:1 (1000х1000)"
                }
              ]
            },
            {
              "type": "text",
              "content": "Выше интерактивная картинка, с полезными ползунками (точки на картинке активные). Переходим по <a href='https://home-northeast-preparing-mitchell.trycloudflare.com/' target='_blank'>этой ссылке</a> и попадает в главное меню"
            },
            {
              "type": "image",
              "src": "images/Stable_diffusion_1.png",
              "alt": "Пример изображения 1"
            },
            {
              "type": "text",
              "content": "Выставляет предварительные настройки, обязательные! Это количество шагов (от 20 до 40) Чем больше, тем лучше, но тем и дольше. И размер изображения (Width - Ширина, Height - высота. 9:16 (1080х1920), 1:1 (1000х1000). После этого можем писать PROMT"
            },
            {
              "type": "image",
              "src": "images/Stable_diffusion_2.png",
              "alt": "Пример изображения 2"
            },
            {
              "type": "text",
              "content": "Перед генерацией картинки, можно выбрать СТИЛЬ. Все стили можно посмотреть по <a href='https://disk.yandex.ru/d/41AbZp_OuWAMeA' target='_blank'>этой ссылке</a>, запрос был кот-воин, чтобы понять вектор направления. Но есть универсальные. Типо для создания фотореалистичного человека например. Так же можно вообще не использовать стиль"
            },
            {
              "type": "image",
              "src": "images/Stable_diffusion_3.png",
              "alt": "Пример изображения 3"
            },
            {
              "type": "text",
              "content": "После выбора всех настроек и написания промта, нажимает кнопку Generate и дожидаемся результата"
            },
            {
              "type": "image",
              "src": "images/Stable_diffusion_4.png",
              "alt": "Пример изображения 4"
            },
            {
              "type": "text",
              "content": "Полученный результат, можно скачать. Если картинка не устраивает, вновь можно нажать Generate. Здесь можно ничего не менять. А можно поиграть со стилями и промтом"
            },
            {
              "type": "image",
              "src": "images/Stable_diffusion_5.png",
              "alt": "Пример изображения 5"
            },
            {
              "type": "text",
              "content": "Второй метод. Это генерация картинки с основой в виде другой картинки. Переходи во вкладку img2img. Внизу поле, есть img2img, это генерация на основе картинки, главное выставить верную высоту и ширину, под стать картинки которую загрузили. Inpaint это генерация области на уже готовой картинке (загружаешь, выделяешь область и пишешь промт) "
            }
          ]
        }
      },
      {
        "title": "Улучшение изображения",
        "guide": {
          "sections": [
            {
              "type": "text",
              "content": "В этом гайде, мы расскажем как улучшить изображение. Перейдите по <a href='https://township-fundamental-extra-lovers.trycloudflare.com' target='_blank'>этой ссылке</a>, открывается меню"
            },
            {
              "type": "image",
              "src": "images/improve_1.png",
              "alt": "Изображение 1"
            },
            {
              "type": "text",
              "content": "Открываем вкладку OPTIONS и выставляем так, как на картинке (1 ползунок максимум, 2 ползунок минимум, 3 ползунок максимум)"
            },
            {
              "type": "image",
              "src": "images/improve_2.png",
              "alt": "Изображение 2"
            },
            {
              "type": "text",
              "content": "В поле INPUT IMAGE, загружаем картинку и жмём Enchance image. Дожидаемся загрузки и в правом окне, получаем улучшенный результат"
            },
            {
              "type": "image",
              "src": "images/improve_3.png",
              "alt": "Изображение 3"
            },
            {
              "type": "text",
              "content": "Сверху есть две вкладки Single image (одну картинку сделать) или Batch Process (это сделать сразу много картинок)"
            },
            {
              "type": "image",
              "src": "images/improve_4.png",
              "alt": "Изображение 4"
            }
          ]
        }
      },
      {
        "title": "Идеальный PROMT для картинок",
        "guide": {
          "sections": [
            {
              "type": "text",
              "content": "ВМЕСТО КВАДРАТНЫХ СКОБОК ВСТАВЛЯЕМ ТО, ЧТО НУЖНО. You are a text prompt generator for creating images. I will give you a post topic, and you will generate **one** best-quality prompt and show it to me.\n\n[что вы хотите нарисовать]\n\nDo **not** ask for clarifications—just generate the best prompt using your creativity, and I will request changes if needed.\n\n### Prompt Structure:\n- **Camera angle → Scene description → Character description → Camera settings**\n- **Character descriptions must always be separated by commas.**\n- **All parts of the structure must be separated by commas.**\n\n### Notes:\n- At the end of the prompt, you may also include the camera type (if it's not a painting style), such as **DSLR, Nikon D, Canon EOS R3, etc.**\n- You can specify a lens type (e.g., **14mm focal length, 35mm, fisheye, wide-angle, etc.**) if necessary.\n\n### Example Formatting:\n- **Highly detailed watercolor painting, majestic lion, intricate fur detail, photograph, natural lighting, brush strokes, watercolor splatters**\n- **Portrait photo of a red-haired girl standing in water covered with lily pads, long braided hair, Canon EOS R3, volumetric lighting**\n- **Wide-angle, stunning sunset over a wide open beach, vibrant pink-orange and gold sky, water reflecting sunset colors, mesmerizing effect, lone tall tree in foreground, tree silhouetted against sunset, dramatic feel, Canon EOS R3, landscape scene**\n- **Watercolor painting, family of elephants roaming the savanna, delicate brush strokes, soft colors, Canon EOS R3, wide-angle lens**\n\n### IMPORTANT:\nGenerate the **best possible** prompt **immediately** in **English**, and show **only** the prompt. Do not write anything else."
            },
            {
              "type": "image",
              "src": "images/improve_11.png",
              "alt": "Изображение 1"
            }
          ]
        }
      }
    ]
  },
  {
    "title": "ВИДЕО",
    "submenus": [
      { "title": "Генерация видео из изображения" },
      { "title": "Генерация видео по тексту" }
    ]
  },
  {
    "title": "ТЕКСТ",
    "submenus": [
      {
        "title": "Из аудио в текст",
        "guide": {
          "sections": [
            {
              "type": "text",
              "content": "В этом гайде мы расскажем, как преобразовать аудио в текст. Для начала перейдите по <a href='https://peace-gentleman-mh-disabilities.trycloudflare.com' target='_blank'>этой ссылке</a>, откроется меню."
            },
            {
              "type": "image",
              "src": "images/audio_to_text_1.png",
              "alt": "Загрузка аудиофайла"
            },
            {
              "type": "text",
              "content": "Сверху выберите Audio file и в поле ниже, вставьте свой файл (перенести или загрузить с компьютера)."
            },
            {
              "type": "image",
              "src": "images/audio_to_text_2.png",
              "alt": "Обработка аудио"
            },
            {
              "type": "text",
              "content": "Нажмите кнопку Submit и дождитесь окончания загрузки. После скопируйте весь текст в Word."
            },
            {
              "type": "image",
              "src": "images/audio_to_text_3.png",
              "alt": "Результат конвертации"
            }
          ]
        }
      }
    ]
  }
]
